package model;

public class StoryData {
    public static final Object[][] SCENE_1 = {
        {"", "ความรักมีหลายรสชาติ", "", ""},
        {"", "บางครั้งหวานละมุน จนหัวใจพองฟูเหมือนขนมสายไหมที่ละลายช้า ๆ บนปลายลิ้น", "", ""},
        {"", "บางครั้งขมจัด ราวกับน้ำชาที่ลืมเติมนมและน้ำตาล กลืนลงไปแล้วเหลือเพียงรสฝาดในอก", "", ""},
        {"", "ในโลกใบนี้มีเรื่องราวความรักมากมาย", "", ""},
        {"", "และเรื่องของฉัน กำลังจะกลายเป็นหนึ่งในนั้น", "", ""},
    };

   public static final Object[][] SCENE_2 = {
        {"", "เจ็ดปี...", "Teeraphat.png", "whiteroom.png"},
        {"", "ไม่ใช่ตัวเลขเล็ก ๆ มันยาวพอให้ฉันจำได้ว่าเขาชอบกาแฟแบบไหน", "", "whiteroom.png"},
        {"", "ยาวพอให้คุ้นเคยกับจังหวะลมหายใจของกันและกัน", "", "whiteroom.png"},
        {"", "ยาวพอให้เริ่มเรียกเขาในใจว่า “อนาคต”", "", "whiteroom.png"},
        {"", "พวกเราคุยกันเรื่องหมั้นหมาย", "", "engaged.png"},
        {"", "ดูฤกษ์คร่าว ๆ พูดถึงบ้าน", "", "engaged.png"},
        {"", "พูดถึงชีวิตหลังจากนั้น", "", "engaged.png"},
        {"", "ยังไม่มีแหวน", "", "whiteroom.png"},
        {"", "ยังไม่มีพิธี", "", "whiteroom.png"},
        {"", "แต่ทุกอย่างกำลังเคลื่อนไปในทิศทางเดียวกัน", "", "whiteroom.png"},
        {"", "แต่บางครั้ง", "", "black.jpg"},
        {"", "เวลาที่เรารอ", "", "black.jpg"},
        {"", "อาจกำลังพาใครบางคนเดินออกไป", "", "black.jpg"},
        {"", "“เราเลิกกันเถอะ” น้ำเสียงนั้นราบเรียบเกินไป", "", "darkroom.png"},
        {"", "ฉันเห็นผู้หญิงคนนั้นยืนข้าง ๆ เขาด้วยรอยยิ้มบาง ๆ เหมือนฉันเป็นแค่คนแปลกหน้า", "", "darkroom.png"},
        {"", "“ก็… มันเปลี่ยนไปแล้ว” เขาพูดเหมือนเจ็ดปีเป็นเพียงแค่ฤดูหนึ่งที่ผ่านไป", "", "darkroom.png"},
        {"", "ฉันยืนอยู่ตรงนั้น เหมือนคนโง่ที่เพิ่งรู้ตัวว่าตัวเองเชื่อในสิ่งที่ไม่มีอยู่จริง", "", "darkroom.png"},

    };
    
    public static final Object[][] SCENE_3 = {
        {"PLAYER", "สวัสดี ฉันชื่อ นะ", "ahri.png", "scene1.jpg"},
        {"PLAYER", "ยินดีที่ได้รู้จักนะ", "ahri.png", "scene1.jpg"}
    };

    public static final Object[][] SCENE_4 = {
        {"PLAYER", "ยินดีที่ได้รู้จักนะ...............", "char/ahri_happy.png", "img_scene/scene1.jpg"},
        {"PLAYER", "ยินดีที่ได้รู้จักนะ...............", "char/ahri_smile.png", "img_scene/old_building.jpg"}
    };

    
}